Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ1025DAH169.PIC
      <edc:SFRDef edc:_addr="0x1F860020" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nn---nn-nnnnnnnn" edc:cname="PORTA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffc6ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xx---xx-xxxxxxxx" edc:name="PORTA" edc:nzwidth="0x20" edc:por="----------------xx---xx-xxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA5" edc:desc="" edc:mask="0x1" edc:name="RA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA6" edc:desc="" edc:mask="0x1" edc:name="RA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA9" edc:desc="" edc:mask="0x1" edc:name="RA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA10" edc:desc="" edc:mask="0x1" edc:name="RA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RA14" edc:desc="" edc:mask="0x1" edc:name="RA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA15" edc:desc="" edc:mask="0x1" edc:name="RA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860030" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nn---nn-nnnnnnnn" edc:cname="LATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffc6ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xx---xx-xxxxxxxx" edc:name="LATA" edc:nzwidth="0x20" edc:por="----------------xx---xx-xxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA9" edc:desc="" edc:mask="0x1" edc:name="LATA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA10" edc:desc="" edc:mask="0x1" edc:name="LATA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATA14" edc:desc="" edc:mask="0x1" edc:name="LATA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA15" edc:desc="" edc:mask="0x1" edc:name="LATA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860040" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nn---nn-nnnnnnnn" edc:cname="ODCA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffc6ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00---00-00000000" edc:name="ODCA" edc:nzwidth="0x20" edc:por="----------------00---00-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCA0" edc:desc="" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA1" edc:desc="" edc:mask="0x1" edc:name="ODCA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA2" edc:desc="" edc:mask="0x1" edc:name="ODCA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA3" edc:desc="" edc:mask="0x1" edc:name="ODCA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA4" edc:desc="" edc:mask="0x1" edc:name="ODCA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA5" edc:desc="" edc:mask="0x1" edc:name="ODCA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA6" edc:desc="" edc:mask="0x1" edc:name="ODCA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA7" edc:desc="" edc:mask="0x1" edc:name="ODCA7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA9" edc:desc="" edc:mask="0x1" edc:name="ODCA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA10" edc:desc="" edc:mask="0x1" edc:name="ODCA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCA14" edc:desc="" edc:mask="0x1" edc:name="ODCA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA15" edc:desc="" edc:mask="0x1" edc:name="ODCA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860050" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nn---nn-nnnnnnnn" edc:cname="CNPUA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffc6ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00---00-00000000" edc:name="CNPUA" edc:nzwidth="0x20" edc:por="----------------00---00-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUA0" edc:desc="" edc:mask="0x1" edc:name="CNPUA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA1" edc:desc="" edc:mask="0x1" edc:name="CNPUA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA2" edc:desc="" edc:mask="0x1" edc:name="CNPUA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA3" edc:desc="" edc:mask="0x1" edc:name="CNPUA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA4" edc:desc="" edc:mask="0x1" edc:name="CNPUA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA5" edc:desc="" edc:mask="0x1" edc:name="CNPUA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA6" edc:desc="" edc:mask="0x1" edc:name="CNPUA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA7" edc:desc="" edc:mask="0x1" edc:name="CNPUA7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA9" edc:desc="" edc:mask="0x1" edc:name="CNPUA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA10" edc:desc="" edc:mask="0x1" edc:name="CNPUA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA14" edc:desc="" edc:mask="0x1" edc:name="CNPUA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA15" edc:desc="" edc:mask="0x1" edc:name="CNPUA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860060" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nn---nn-nnnnnnnn" edc:cname="CNPDA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffc6ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00---00-00000000" edc:name="CNPDA" edc:nzwidth="0x20" edc:por="----------------00---00-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDA0" edc:desc="" edc:mask="0x1" edc:name="CNPDA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA1" edc:desc="" edc:mask="0x1" edc:name="CNPDA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA2" edc:desc="" edc:mask="0x1" edc:name="CNPDA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA3" edc:desc="" edc:mask="0x1" edc:name="CNPDA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA4" edc:desc="" edc:mask="0x1" edc:name="CNPDA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA5" edc:desc="" edc:mask="0x1" edc:name="CNPDA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA6" edc:desc="" edc:mask="0x1" edc:name="CNPDA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA7" edc:desc="" edc:mask="0x1" edc:name="CNPDA7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDA9" edc:desc="" edc:mask="0x1" edc:name="CNPDA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA10" edc:desc="" edc:mask="0x1" edc:name="CNPDA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDA14" edc:desc="" edc:mask="0x1" edc:name="CNPDA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA15" edc:desc="" edc:mask="0x1" edc:name="CNPDA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860070" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------n---n-----------" edc:cname="CNCONA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONA" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE A" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860080" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nn---nn-nnnnnnnn" edc:cname="CNENA" edc:desc="" edc:grp="PORTA" edc:impl="0xffc0c6ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00---00-00000000" edc:name="CNENA" edc:nzwidth="0x20" edc:por="----------------00---00-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEA0" edc:desc="" edc:mask="0x1" edc:name="CNIEA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA1" edc:desc="" edc:mask="0x1" edc:name="CNIEA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA2" edc:desc="" edc:mask="0x1" edc:name="CNIEA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA3" edc:desc="" edc:mask="0x1" edc:name="CNIEA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA4" edc:desc="" edc:mask="0x1" edc:name="CNIEA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA5" edc:desc="" edc:mask="0x1" edc:name="CNIEA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA6" edc:desc="" edc:mask="0x1" edc:name="CNIEA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA7" edc:desc="" edc:mask="0x1" edc:name="CNIEA7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEA9" edc:desc="" edc:mask="0x1" edc:name="CNIEA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA10" edc:desc="" edc:mask="0x1" edc:name="CNIEA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEA14" edc:desc="" edc:mask="0x1" edc:name="CNIEA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA15" edc:desc="" edc:mask="0x1" edc:name="CNIEA15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
