Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ1025DAH169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA8C4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA49" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA49" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1215" edc:desc="" edc:mask="0xf" edc:name="PIXEL1215" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1214" edc:desc="" edc:mask="0xf" edc:name="PIXEL1214" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1213" edc:desc="" edc:mask="0xf" edc:name="PIXEL1213" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1212" edc:desc="" edc:mask="0xf" edc:name="PIXEL1212" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1211" edc:desc="" edc:mask="0xf" edc:name="PIXEL1211" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1210" edc:desc="" edc:mask="0xf" edc:name="PIXEL1210" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL129" edc:desc="" edc:mask="0xf" edc:name="PIXEL129" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL128" edc:desc="" edc:mask="0xf" edc:name="PIXEL128" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8C8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA50" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA50" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1223" edc:desc="" edc:mask="0xf" edc:name="PIXEL1223" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1222" edc:desc="" edc:mask="0xf" edc:name="PIXEL1222" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1221" edc:desc="" edc:mask="0xf" edc:name="PIXEL1221" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1220" edc:desc="" edc:mask="0xf" edc:name="PIXEL1220" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1219" edc:desc="" edc:mask="0xf" edc:name="PIXEL1219" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1218" edc:desc="" edc:mask="0xf" edc:name="PIXEL1218" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1217" edc:desc="" edc:mask="0xf" edc:name="PIXEL1217" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1216" edc:desc="" edc:mask="0xf" edc:name="PIXEL1216" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8CC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA51" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA51" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1231" edc:desc="" edc:mask="0xf" edc:name="PIXEL1231" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1230" edc:desc="" edc:mask="0xf" edc:name="PIXEL1230" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1229" edc:desc="" edc:mask="0xf" edc:name="PIXEL1229" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1228" edc:desc="" edc:mask="0xf" edc:name="PIXEL1228" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1227" edc:desc="" edc:mask="0xf" edc:name="PIXEL1227" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1226" edc:desc="" edc:mask="0xf" edc:name="PIXEL1226" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1225" edc:desc="" edc:mask="0xf" edc:name="PIXEL1225" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1224" edc:desc="" edc:mask="0xf" edc:name="PIXEL1224" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8D0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA52" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA52" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL137" edc:desc="" edc:mask="0xf" edc:name="PIXEL137" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL136" edc:desc="" edc:mask="0xf" edc:name="PIXEL136" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL135" edc:desc="" edc:mask="0xf" edc:name="PIXEL135" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL134" edc:desc="" edc:mask="0xf" edc:name="PIXEL134" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL133" edc:desc="" edc:mask="0xf" edc:name="PIXEL133" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL132" edc:desc="" edc:mask="0xf" edc:name="PIXEL132" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL131" edc:desc="" edc:mask="0xf" edc:name="PIXEL131" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL130" edc:desc="" edc:mask="0xf" edc:name="PIXEL130" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8D4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA53" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA53" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1315" edc:desc="" edc:mask="0xf" edc:name="PIXEL1315" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1314" edc:desc="" edc:mask="0xf" edc:name="PIXEL1314" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1313" edc:desc="" edc:mask="0xf" edc:name="PIXEL1313" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1312" edc:desc="" edc:mask="0xf" edc:name="PIXEL1312" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1311" edc:desc="" edc:mask="0xf" edc:name="PIXEL1311" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1310" edc:desc="" edc:mask="0xf" edc:name="PIXEL1310" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL139" edc:desc="" edc:mask="0xf" edc:name="PIXEL139" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL138" edc:desc="" edc:mask="0xf" edc:name="PIXEL138" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA8D8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA54" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA54" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1323" edc:desc="" edc:mask="0xf" edc:name="PIXEL1323" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1322" edc:desc="" edc:mask="0xf" edc:name="PIXEL1322" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1321" edc:desc="" edc:mask="0xf" edc:name="PIXEL1321" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1320" edc:desc="" edc:mask="0xf" edc:name="PIXEL1320" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1319" edc:desc="" edc:mask="0xf" edc:name="PIXEL1319" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1318" edc:desc="" edc:mask="0xf" edc:name="PIXEL1318" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1317" edc:desc="" edc:mask="0xf" edc:name="PIXEL1317" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1316" edc:desc="" edc:mask="0xf" edc:name="PIXEL1316" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
